tap "zingerlittlebee/tap"
brew "bat"
brew "eza"
brew "fzf"
brew "gh"
brew "micro"
brew "mole"
brew "node@24"
brew "opencode"
brew "zoxide"
cask "font-maple-mono-nf-cn"
cask "ghostty"
cask "google-chrome"
cask "hoppscotch"
cask "pixpin"
cask "stats"
cask "telegram-desktop"
cask "typora"
cask "visual-studio-code"
cask "xmind"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "google.gemini-cli-vscode-ide-companion"
vscode "google.geminicodeassist"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "vscode-icons-team.vscode-icons"
